from random import choice

mnames = ["Глеб", "Василий", "Дмитрий", "Геннадий", "Алексей", "Владислав", "Владимир", "Георгий", "Александр",
         "Максим", "Петр", "Николай", "Андрей", "Яков", "Серафим", "Евгений", "Михаил", "Артем", "Даниил"]
msurnames = [ "Маркин", "Черкашев", "Таубер", "Каменцев", "Городецкий", "Верный", "Любовец",
            "Петров", "Иванов", "Фролов", "Романов", "Воробьёв", "Сорокин", "Белов", "Жуков", "Крылов"]
mmiddlename = [ "Алексеевич", "Валентинович", "Александрович", "Викторович", "Гавриилович", "Егорович", "Нефёдович",
            "Рюрикович", "Степанович", "Федорович", "Якович", "Ульянович", "Прохорович", "Петрович", "Павлович", "Львович"]

fnames = ["Алина", "Максим", "Александра", "Елена", "Ирина", "Валентина", "Кира", "Полина", "Лана",
         "Диана", "Эмилия", "Любовь", "Юлия", "Ульяна", "Виктория", "Кристина", "Софья", "Маргарита", "Лилия"]
fsurnames = [ "Добрынина", "Цветова", "Есенина", "Бондаренко", "Зайцева", "Грушина", "Кожевникова",
            "Глебова", "Булгакова", "Миронова", "Белая", "Кузнецова", "Медведева", "Конева", "Зимина", "Краснова"]
fmiddlename = [ "Акимовна", "Артёмовна", "Валентиновна", "Георгиевна", "Данииловна", "Евдокимовна", "Елисеевна",
            "Игнатьевна", "Исааковна", "Иванова", "Климовна", "Марковна", "Остаповна", "Петровна", "Рюриковна", "Юрьевна"]


def gen_unique_names(how_many: int):
    answer = []
    while how_many > 0:
        
        sex = ["m","f"]
        user_sex = choice(sex)
        if  user_sex == "m":
            combo = choice(msurnames) + ' ' + choice(mnames) + ' ' + choice(mmiddlename)
        if  user_sex == "f":
            combo = choice(fsurnames) + ' ' + choice(fnames) + ' ' + choice(fmiddlename)

        if combo not in answer:
            answer.append(combo)
            how_many -= 1

        return combo

